# **MISSING DATA**

1. Real world data will often be missing data.
2. Many ML models and statistical methods can't work with missing data.
3. Missing data in pandas is represented as NaN values
4. Newer specialized null pandas values such as pd.NaT to imply the value missing should be a timestamp

## What to do with missing data?

- Depending on the situation decide whether to:
- Keep it 
- Remove it
- Replace it

## Keeping the missing data

- Pros:
   - Easiest to do
   - Does not manipulate or change the true data
- Cons:
   - Many methods do not support NaN
   - Often there are reasonable guesses

## Dropping the missing data

- Pros:
  - Easy to do
  - Can be based on rules
- Cons:
  - Potential to lose lots of data or useful info
  - Limits trained models for future data

### Droping a row

- Makes sense when a lot of info is missing

| Country | Year | Pop  | GDP  | Area |
|---------|------|------|------|------|
| USA     | 1776 | NAN  | NAN  | NAN  |
| CANADA  | 1867 | 38   | 1.7  | 3.86 |
| MEXICO  | 1821 | 126  | 1.22 | 0.76 |

- Clearly 'USA' data point as a row should probably be removed.

| Country | Year | Pop  | GDP  | Area |
|---------|------|------|------|------|
| CANADA  | 1867 | 38   | 1.7  | 3.86 |
| MEXICO  | 1821 | 126  | 1.22 | 0.76 |

- Make it a priority to determine the percentage of data being dropped.

### Dropping a column

- If row is missing a paritcular feature

| Country | Year | Pop  | GDP  | Area |
|---------|------|------|------|------|
| USA     | 1776 | 328  | 20.5 | NAN  |
| CANADA  | 1867 | 38   | 1.7  | NAN  |
| MEXICO  | 1821 | 126  | 1.22 | 0.76 |

- Area column has a lot of NaN values, it would be better to drop the Area column instead of dropping a row

| Country | Year | Pop  | GDP  |
|---------|------|------|------|
| USA     | 1776 | 328  | 20.5 |
| CANADA  | 1867 | 38   | 1.7  |
| MEXICO  | 1821 | 126  | 1.22 |

## Filling in the missing data

- Pros:
  - Potential to save a lot of data for use in training a model
- Cons:
  - Hardest to do and somewhat arbitrary
  - Potential to lead to false conclusions

- Fill with same value
  - Good choice if NaN was a placeholder

| Country | Year | Pop  | GDP  | Carriers |
|---------|------|------|------|------|
| USA     | 1776 | 328  | 20.5 | 11  |
| CANADA  | 1867 | 38   | 1.7  | NAN  |
| MEXICO  | 1821 | 126  | 1.22 | NAN |

- Here NaN can be replaced with 0

| Country | Year | Pop  | GDP  | Carriers |
|---------|------|------|------|------|
| USA     | 1776 | 328  | 20.5 | 11  |
| CANADA  | 1867 | 38   | 1.7  | 0  |
| MEXICO  | 1821 | 126  | 1.22 | 0 |

- Fill with interpolated or estimated value

| Country | Year | Pop  | GDP  | Percentage |
|---------|------|------|------|------|
| USA     | 1776 | 328  | 20.5 | 75%  |
| CANADA  | 1867 | 38   | 1.7  | NaN  |
| MEXICO  | 1821 | 126  | 1.22 | 35% |

- Much harder and requires reasonable assumptions

| Country | Year | Pop  | GDP  | Percentage |
|---------|------|------|------|------|
| USA     | 1776 | 328  | 20.5 | 75%  |
| CANADA  | 1867 | 38   | 1.7  | 55%  |
| MEXICO  | 1821 | 126  | 1.22 | 35% |

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.nan

nan

In [3]:
pd.NA

In [4]:
pd.NaT

NaT

In [5]:
np.nan == np.nan

False

In [6]:
np.nan is np.nan

True

In [7]:
myvar = np.nan

In [8]:
myvar is np.nan

True

In [9]:
df = pd.read_csv('movie_scores.csv')

In [10]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

## How to check and select null values?

In [11]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [12]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [13]:
df['pre_movie_score'].notnull()

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [14]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [15]:
df[df['pre_movie_score'].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [16]:
df[(df['pre_movie_score'].isnull()) & (df['first_name'].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

## Dropping the data

In [17]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels: 'IndexLabel | None' = None, *, axis: 'Axis' = 0, index: 'IndexLabel | None' = None, columns: 'IndexLabel | None' = None, level: 'Level | None' = None, inplace: 'bool' = False, errors: 'IgnoreRaise' = 'raise') -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by directly specifying index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the :ref:`user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        in place and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        Returns DataFrame or None DataFrame with the specified
        index or column labels removed or None if inplace=True.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    llama   speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [20]:
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [22]:
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [23]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [27]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [30]:
df.fillna(df.mean(numeric_only=True))

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1        NaN       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

In [31]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [32]:
ser = pd.Series(airline_tix)

In [33]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [34]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64